#+STARTUP: lognotedone
#+STARTUP: inlineimages

****** Archived remarks: Translation

Ironically, once we implement things to simplify rotations as much as
possible, this operation now becomes a bit tricky to implement. We
need to be able to tell when a tetromino at an arbitary position in
the Tetris board equals a key in our hash table. That is, a piece will
have undergone an arbitrary set of translations (a series of down,
left, and right moves); if we implement a tetromino as a static set of
coordinates reflecting its position on the board, these must by
necessity be updated with each translation, ruining our equality
scheme.

We could record all translations that have been played so far, and use
those to revert the piece back to its point of origin. We would then
compute the rotation, and replay the translations back to derive the
correct current state of the piece.

Another possibility, one that looks preferable for being simpler, is
to represent each piece instead as a /path/. This leads into the board
representation we'll be using: a simple two-dimensional array of
integers. Since paths don't change under translation, we no
longer need an extra buffer recording previous translations. Also,
finding the beginning of a piece is relatively simple: give its
/lexically first/ cell a value of, say, -2. The other piece-cells
would have a value of -1. (These peculiar negative values will be
explained in due time.) There would be a resulting collection of
negative values; deltas would be computed from the -2 cell to the
remaining ones, which are used to derived the set used to index into
the rotation hash-table.

#+begin_src java :classname Main
  import java.util.*;

  // Name these two things differently for legibility.
  record Delta(int dr, int dc) { }

  record Point(int row, int column) {
      public static Point add(Point point, Delta delta) {
          return new Point(point.row() + delta.dr(), point.column() + delta.dc());
      }

      public static Delta difference(Point end, Point start) {
          return new Delta(end.row() - start.row(), end.column() - start.column());
      }

      // List<Delta> == Tetromino
      public static List<Delta> convertPointsToDeltas(List<Point> points) {
          List<Delta> tetromino = new ArrayList<>();

          for (var i = 1; i < points.size(); i++) {
              tetromino.add(Point.difference(points.get(i), points.getFirst()));
          }

          return tetromino;
      }
  }

  record Rotation(List<Delta> tetromino, Delta originDelta) { }

  class TetrisBoard {
      public final int numRows;
      public final int numColumns;

      private int[][] board;

      public TetrisBoard(int numRows, int numColumns) {
          board = new int[numRows][numColumns];
          this.numRows = numRows;
          this.numColumns = numColumns;
      }

      @Override
      public String toString() {
          var builder = new StringBuilder();
           
          for (var row : board) {
              for (var cell : row) {
                  builder.append(" %2d".formatted(cell));
              }

              builder.append('\n');
          }

          return builder.toString();
      }

      public boolean isTetrominoCell(int rowIndex, int columnIndex) {
          return board[rowIndex][columnIndex] == -1;
      }

      public void drawTetromino(Point origin, List<Delta> tetromino) {
          writeTetromino(origin, tetromino, -1);
      }

      public void eraseTetromino(Point origin, List<Delta> tetromino) {
          writeTetromino(origin, tetromino, 0);
      }

      private void writeTetromino(Point origin, List<Delta> tetromino, int value) {
          board[origin.row()][origin.column()] = value;
          
          for (var delta : tetromino) {
              var currentPoint = Point.add(origin, delta);
              board[currentPoint.row()][currentPoint.column()] = value;
          }
      }
  }

  class Main {
      public static void main(String[] args) {
          var J1 = List.of(new Delta(1, 0),
                           new Delta(2, -1),
                           new Delta(2, 0));

          var J2 = List.of(new Delta(0, 1),
                           new Delta(0, 2),
                           new Delta(1, 2));

          var J3 = List.of(new Delta(0, 1),
                           new Delta(1, 0),
                           new Delta(2, 0));

          var J4 = List.of(new Delta(1, 0),
                           new Delta(1, 1),
                           new Delta(1, 2));
          
          Map<List<Delta>, Rotation> rotationTable = Map.of(J1, new Rotation(J2, new Delta(0, -2)),
                                                            J2, new Rotation(J3, new Delta(0, 1)),
                                                            J3, new Rotation(J4, new Delta(0, 0)),
                                                            J4, new Rotation(J1, new Delta(0, 1)));

          // Let's make a reverse table to enable clockwise rotation.
          Map<List<Delta>, Rotation> tmp = new HashMap<>();

          for (var entry : rotationTable.entrySet()) {
              var tetromino = entry.getKey();
              var rotation = entry.getValue();
              var nextTetromino = rotation.tetromino();
              var originDelta = rotation.originDelta();

              tmp.put(nextTetromino, new Rotation(tetromino, new Delta(-originDelta.dr(),
                                                                       -originDelta.dc())));
          }

          Map<List<Delta>, Rotation> reverseRotationTable = Map.copyOf(tmp);
          
          // Let's use a smaller board for the purposes of this demonstration.
          var tetrisBoard = new TetrisBoard(6, 6);

          tetrisBoard.drawTetromino(new Point(0, 3), J1);

          System.out.println("Board after introducing J:");
          System.out.println(tetrisBoard);

          // This is where it gets interesting: I want the rotationTable
          // to kick in now.
          //
          // Note that the board is stateless over what the current
          // tetromino is. We'll find out what the current tetromino is
          // using the following code.

          List<Point> pieceCells = new ArrayList<>();
          
          for (var rowIndex = 0; rowIndex < tetrisBoard.numRows; rowIndex++) {
              for (var columnIndex = 0; columnIndex < tetrisBoard.numColumns; columnIndex++) {
                  if (tetrisBoard.isTetrominoCell(rowIndex, columnIndex)) {
                      pieceCells.add(new Point(rowIndex, columnIndex));
                  }
              }
          }

          var tetromino = Point.convertPointsToDeltas(pieceCells);
          System.out.println("We found a J tetromino: " + tetromino);

          // Now that we've found the tetromino, we can erase it in
          // preparation for drawing its next rotation.
          tetrisBoard.eraseTetromino(pieceCells.getFirst(), tetromino);

          var nextRotation = rotationTable.get(tetromino);
          var nextTetromino = nextRotation.tetromino();
          var originDelta = nextRotation.originDelta(); 

          tetrisBoard.drawTetromino(Point.add(pieceCells.getFirst(), originDelta), nextTetromino);

          System.out.println();
          System.out.println("Board after rotation J once counterclockwise:");
          System.out.println(tetrisBoard);

          // Now, let's see if we can translate the piece downward one
          // space.
          //
          // We should eventually have this tetromino-finding code in
          // its own method.

          pieceCells = new ArrayList<>();

          for (var rowIndex = 0; rowIndex < tetrisBoard.numRows; rowIndex++) {
              for (var columnIndex = 0; columnIndex < tetrisBoard.numColumns; columnIndex++) {
                  if (tetrisBoard.isTetrominoCell(rowIndex, columnIndex)) {
                      pieceCells.add(new Point(rowIndex, columnIndex));
                  }
              }
          }

          // What's amazing about this is that we don't need new logic
          // to handle translation: we simply treat it as a "degenerate
          // case" of a rotation.
          tetromino = Point.convertPointsToDeltas(pieceCells);
          tetrisBoard.eraseTetromino(pieceCells.getFirst(), tetromino);
          tetrisBoard.drawTetromino(Point.add(pieceCells.getFirst(), new Delta(1, 0)), tetromino);

          System.out.println();
          System.out.println("Board after moving J down one space:");
          System.out.println(tetrisBoard);

          // Let's rotate it again.
          pieceCells = new ArrayList<>();

          for (var rowIndex = 0; rowIndex < tetrisBoard.numRows; rowIndex++) {
              for (var columnIndex = 0; columnIndex < tetrisBoard.numColumns; columnIndex++) {
                  if (tetrisBoard.isTetrominoCell(rowIndex, columnIndex)) {
                      pieceCells.add(new Point(rowIndex, columnIndex));
                  }
              }
          }

          tetromino = Point.convertPointsToDeltas(pieceCells);
          System.out.println("We found a J tetromino: " + tetromino);

          // Now that we've found the tetromino, we can erase it in
          // preparation for drawing its next rotation.
          tetrisBoard.eraseTetromino(pieceCells.getFirst(), tetromino);


          nextRotation = rotationTable.get(tetromino);
          nextTetromino = nextRotation.tetromino();
          originDelta = nextRotation.originDelta(); 

          tetrisBoard.drawTetromino(Point.add(pieceCells.getFirst(), originDelta), nextTetromino);

          System.out.println();
          System.out.println("Board after another rotation of J:");
          System.out.println(tetrisBoard);

          // Finally, let's attempt a clockwise rotation back to the
          // previous orientation.
          
          pieceCells = new ArrayList<>();

          for (var rowIndex = 0; rowIndex < tetrisBoard.numRows; rowIndex++) {
              for (var columnIndex = 0; columnIndex < tetrisBoard.numColumns; columnIndex++) {
                  if (tetrisBoard.isTetrominoCell(rowIndex, columnIndex)) {
                      pieceCells.add(new Point(rowIndex, columnIndex));
                  }
              }
          }

          tetromino = Point.convertPointsToDeltas(pieceCells);
          System.out.println("We found a J tetromino: " + tetromino);

          // Now that we've found the tetromino, we can erase it in
          // preparation for drawing its next rotation.
          tetrisBoard.eraseTetromino(pieceCells.getFirst(), tetromino);


          nextRotation = reverseRotationTable.get(tetromino);
          nextTetromino = nextRotation.tetromino();
          originDelta = nextRotation.originDelta(); 

          tetrisBoard.drawTetromino(Point.add(pieceCells.getFirst(), originDelta), nextTetromino);

          System.out.println();
          System.out.println("Board after rotating clockwise to previous orientation:");
          System.out.println(tetrisBoard);
      }
  }
#+end_src

#+RESULTS:
#+begin_example
Board after introducing J:
  0  0  0 -1  0  0
  0  0  0 -1  0  0
  0  0 -1 -1  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0

We found a J tetromino: [Delta[dr=1, dc=0], Delta[dr=2, dc=-1], Delta[dr=2, dc=0]]

Board after rotation J once counterclockwise:
  0 -1 -1 -1  0  0
  0  0  0 -1  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0


Board after moving J down one space:
  0  0  0  0  0  0
  0 -1 -1 -1  0  0
  0  0  0 -1  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0

We found a J tetromino: [Delta[dr=0, dc=1], Delta[dr=0, dc=2], Delta[dr=1, dc=2]]

Board after another rotation of J:
  0  0  0  0  0  0
  0  0 -1 -1  0  0
  0  0 -1  0  0  0
  0  0 -1  0  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0

We found a J tetromino: [Delta[dr=0, dc=1], Delta[dr=1, dc=0], Delta[dr=2, dc=0]]

Board after rotating clockwise to previous orientation:
  0  0  0  0  0  0
  0 -1 -1 -1  0  0
  0  0  0 -1  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0
  0  0  0  0  0  0

#+end_example

